package org.englising.com.englisingbe.global.util;

import java.util.Arrays;
import java.util.List;

public class StringUtils {
    public static final List<String> symbols = Arrays.asList(
            ".",    // 마침표
            ",",    // 쉼표
            ";",    // 세미콜론
            ":",    // 콜론
            "'",    // 작은따옴표
            "\"",   // 큰따옴표
            "!",    // 느낌표
            "?",    // 물음표
            "(",    // 여는 괄호
            ")",    // 닫는 괄호
            "[",    // 여는 대괄호
            "]",    // 닫는 대괄호
            "{",    // 여는 중괄호
            "}",    // 닫는 중괄호
            "-",    // 하이픈
            "_",    // 언더스코어
            "*",    // 별표
            "/",    // 슬래시
            "\\",   // 역슬래시
            "@",    // 앳 기호
            "#",    // 샵
            "$",    // 달러 기호
            "%",    // 퍼센트
            "^",    // 캐럿
            "&",    // 앰퍼샌드
            "=",    // 등호
            "+",    // 더하기
            "~",    // 틸데
            "|",    // 수직 바
            "<",    // 작다
            ">",    // 크다
            "–",    // 대시
            "…",    // 줄임표
            "‘",    // 왼쪽 홑따옴표
            "’",    // 오른쪽 홑따옴표
            "“",    // 왼쪽 겹따옴표
            "”",    // 오른쪽 겹따옴표
            "♪",    // 음표 기호
            "♫",    // 두 개의 연결된 음표
            "♬",    // 음표 두 개
            "※"     // 참고 기호
    );
}
